tap "jurplel/tap"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for exploring each layer in a docker image
brew "dive"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Kubernetes package manager
brew "helm"
# Tool to set default openers for file formats and url schemes on macOS
brew "infat"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Mac App Store command-line interface
brew "mas"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Modern shell for the GitHub era
brew "nushell"
# Prompt theme engine for any shell
brew "oh-my-posh"
# Shell command parallelization utility
brew "parallel"
# General-purpose scripting language
brew "php"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Implementation of Telnet and SSH
brew "putty"
# SMART hard drive monitoring
brew "smartmontools"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Feature-rich console based todo list manager
brew "task"
# Terminal user interface for taskwarrior
brew "taskwarrior-tui"
# Command-line time tracking application
brew "timewarrior"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display management tool
cask "betterdisplay"
# Tool to run Windows software
cask "crossover"
# Databases and SQL IDE
cask "datagrip"
# Access and store data messages in a local database
cask "datovka"
# Window peeking utility app
cask "dockdoor"
cask "font-jetbrains-mono"
# Update maps and software, sync with Garmin Connect and register your device
cask "garmin-express"
# Chromium-based web browser
cask "helium-browser"
# Convert your caps lock key or any of your modifier keys to the hyper key
cask "hyperkey"
# Free and open-source media player
cask "iina"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# Text editor
cask "macvim-app"
# Cross-platform MQTT 5.0 Desktop Client
cask "mqttx"
# Android file transfer
cask "openmtp"
# Replacement for Docker Desktop
cask "orbstack"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Apple Notes extension
cask "pronotes"
# Print driver for printing documents directly to a pdf file
cask "rwts-pdfwriter"
# Video game digital distribution service
cask "steam"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Open-source engine for Heroes of Might & Magic III
cask "vcmi"
# REST, GraphQL and gRPC client
cask "yaak"
# Multiplayer code editor
cask "zed"
mas "Actions", id: 1586435171
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Hlídač Shopů", id: 1488295734
mas "Infuse", id: 1136220934
mas "LastPass for Safari", id: 6504626762
mas "Mic Drop", id: 1489816366
mas "Numbers", id: 361304891
mas "Playlisty for Apple Music", id: 1459275972
mas "rcmd", id: 1596283165
mas "Reeder", id: 6475002485
mas "Wipr", id: 1662217862
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
uv "bugwarrior[jira,keyring]", with: ["setuptools"]
uv "osxphotos"
