tap "vcmi/vcmi"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Tool to set default openers for file formats and url schemes on macOS
brew "infat"
# Mac App Store command-line interface
brew "mas"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Shell command parallelization utility
brew "parallel"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# SMART hard drive monitoring
brew "smartmontools"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Feature-rich console based todo list manager
brew "task"
# Terminal user interface for taskwarrior
brew "taskwarrior-tui"
# Command-line time tracking application
brew "timewarrior"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Enable Windows-like alt-tab
cask "alt-tab"
# Display management tool
cask "betterdisplay"
# Virtual Audio Driver
cask "blackhole-2ch"
# Tool to run Windows software
cask "crossover"
# Access and store data messages in a local database
cask "datovka"
cask "font-jetbrains-mono"
# Free and open-source media player
cask "iina"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# Text editor
cask "macvim-app"
# Cross-platform MQTT 5.0 Desktop Client
cask "mqttx"
# Replacement for Docker Desktop
cask "orbstack"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Video game digital distribution service
cask "steam"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Open-source engine for Heroes of Might & Magic III
cask "vcmi/vcmi/vcmi"
# REST, GraphQL and gRPC client
cask "yaak"
mas "Actions", id: 1586435171
mas "Baking Soda", id: 1601151613
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Mic Drop", id: 1489816366
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "rcmd", id: 1596283165
mas "Reeder", id: 6475002485
mas "Vinegar", id: 1591303229
mas "Wipr", id: 1662217862
mas "Xcode", id: 497799835
